{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "hrnet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 384, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "stage1_stem_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_stem_conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_stem_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_stem_bn1", "inbound_nodes": [[["stage1_stem_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_stem_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_stem_relu1", "inbound_nodes": [[["stage1_stem_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_stem_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_stem_conv2", "inbound_nodes": [[["stage1_stem_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_stem_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_stem_bn2", "inbound_nodes": [[["stage1_stem_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_stem_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_stem_relu2", "inbound_nodes": [[["stage1_stem_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck1_conv1", "inbound_nodes": [[["stage1_stem_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck1_bn1", "inbound_nodes": [[["stage1_bottleneck1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck1_relu1", "inbound_nodes": [[["stage1_bottleneck1_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck1_conv2", "inbound_nodes": [[["stage1_bottleneck1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck1_bn2", "inbound_nodes": [[["stage1_bottleneck1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck1_relu2", "inbound_nodes": [[["stage1_bottleneck1_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck1_conv3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck1_conv3", "inbound_nodes": [[["stage1_bottleneck1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck1_down_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck1_down_conv", "inbound_nodes": [[["stage1_stem_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck1_bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck1_bn3", "inbound_nodes": [[["stage1_bottleneck1_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck1_down_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck1_down_bn", "inbound_nodes": [[["stage1_bottleneck1_down_conv", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage1_bottleneck1_res", "trainable": true, "dtype": "float32"}, "name": "stage1_bottleneck1_res", "inbound_nodes": [[["stage1_bottleneck1_bn3", 0, 0, {}], ["stage1_bottleneck1_down_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck1_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck1_out", "inbound_nodes": [[["stage1_bottleneck1_res", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck2_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck2_conv1", "inbound_nodes": [[["stage1_bottleneck1_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck2_bn1", "inbound_nodes": [[["stage1_bottleneck2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck2_relu1", "inbound_nodes": [[["stage1_bottleneck2_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck2_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck2_conv2", "inbound_nodes": [[["stage1_bottleneck2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck2_bn2", "inbound_nodes": [[["stage1_bottleneck2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck2_relu2", "inbound_nodes": [[["stage1_bottleneck2_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck2_conv3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck2_conv3", "inbound_nodes": [[["stage1_bottleneck2_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck2_bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck2_bn3", "inbound_nodes": [[["stage1_bottleneck2_conv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage1_bottleneck2_res", "trainable": true, "dtype": "float32"}, "name": "stage1_bottleneck2_res", "inbound_nodes": [[["stage1_bottleneck2_bn3", 0, 0, {}], ["stage1_bottleneck1_out", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck2_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck2_out", "inbound_nodes": [[["stage1_bottleneck2_res", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck3_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck3_conv1", "inbound_nodes": [[["stage1_bottleneck2_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck3_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck3_bn1", "inbound_nodes": [[["stage1_bottleneck3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck3_relu1", "inbound_nodes": [[["stage1_bottleneck3_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck3_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck3_conv2", "inbound_nodes": [[["stage1_bottleneck3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck3_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck3_bn2", "inbound_nodes": [[["stage1_bottleneck3_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck3_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck3_relu2", "inbound_nodes": [[["stage1_bottleneck3_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck3_conv3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck3_conv3", "inbound_nodes": [[["stage1_bottleneck3_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck3_bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck3_bn3", "inbound_nodes": [[["stage1_bottleneck3_conv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage1_bottleneck3_res", "trainable": true, "dtype": "float32"}, "name": "stage1_bottleneck3_res", "inbound_nodes": [[["stage1_bottleneck3_bn3", 0, 0, {}], ["stage1_bottleneck2_out", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck3_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck3_out", "inbound_nodes": [[["stage1_bottleneck3_res", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck4_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck4_conv1", "inbound_nodes": [[["stage1_bottleneck3_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck4_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck4_bn1", "inbound_nodes": [[["stage1_bottleneck4_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck4_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck4_relu1", "inbound_nodes": [[["stage1_bottleneck4_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck4_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck4_conv2", "inbound_nodes": [[["stage1_bottleneck4_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck4_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck4_bn2", "inbound_nodes": [[["stage1_bottleneck4_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck4_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck4_relu2", "inbound_nodes": [[["stage1_bottleneck4_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_bottleneck4_conv3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_bottleneck4_conv3", "inbound_nodes": [[["stage1_bottleneck4_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_bottleneck4_bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_bottleneck4_bn3", "inbound_nodes": [[["stage1_bottleneck4_conv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage1_bottleneck4_res", "trainable": true, "dtype": "float32"}, "name": "stage1_bottleneck4_res", "inbound_nodes": [[["stage1_bottleneck4_bn3", 0, 0, {}], ["stage1_bottleneck3_out", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_bottleneck4_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_bottleneck4_out", "inbound_nodes": [[["stage1_bottleneck4_res", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_transition_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_transition_conv2", "inbound_nodes": [[["stage1_bottleneck4_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_transition_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_transition_bn2", "inbound_nodes": [[["stage1_transition_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_transition_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_transition_relu2", "inbound_nodes": [[["stage1_transition_bn2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_transition_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_transition_conv1", "inbound_nodes": [[["stage1_bottleneck4_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic1_conv1", "inbound_nodes": [[["stage1_transition_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_transition_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_transition_bn1", "inbound_nodes": [[["stage1_transition_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic1_bn1", "inbound_nodes": [[["stage2_branch2_basic1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_transition_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_transition_relu1", "inbound_nodes": [[["stage1_transition_bn1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic1_relu1", "inbound_nodes": [[["stage2_branch2_basic1_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch1_basic1_conv1", "inbound_nodes": [[["stage1_transition_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic1_conv2", "inbound_nodes": [[["stage2_branch2_basic1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch1_basic1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch1_basic1_bn1", "inbound_nodes": [[["stage2_branch1_basic1_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic1_bn2", "inbound_nodes": [[["stage2_branch2_basic1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch1_basic1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch1_basic1_relu1", "inbound_nodes": [[["stage2_branch1_basic1_bn1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage2_branch2_basic1_res", "trainable": true, "dtype": "float32"}, "name": "stage2_branch2_basic1_res", "inbound_nodes": [[["stage2_branch2_basic1_bn2", 0, 0, {}], ["stage1_transition_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic1_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch1_basic1_conv2", "inbound_nodes": [[["stage2_branch1_basic1_relu1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic1_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic1_out", "inbound_nodes": [[["stage2_branch2_basic1_res", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch1_basic1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch1_basic1_bn2", "inbound_nodes": [[["stage2_branch1_basic1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic2_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic2_conv1", "inbound_nodes": [[["stage2_branch2_basic1_out", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage2_branch1_basic1_res", "trainable": true, "dtype": "float32"}, "name": "stage2_branch1_basic1_res", "inbound_nodes": [[["stage2_branch1_basic1_bn2", 0, 0, {}], ["stage1_transition_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic2_bn1", "inbound_nodes": [[["stage2_branch2_basic2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch1_basic1_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch1_basic1_out", "inbound_nodes": [[["stage2_branch1_basic1_res", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic2_relu1", "inbound_nodes": [[["stage2_branch2_basic2_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic2_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch1_basic2_conv1", "inbound_nodes": [[["stage2_branch1_basic1_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic2_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic2_conv2", "inbound_nodes": [[["stage2_branch2_basic2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch1_basic2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch1_basic2_bn1", "inbound_nodes": [[["stage2_branch1_basic2_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic2_bn2", "inbound_nodes": [[["stage2_branch2_basic2_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch1_basic2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch1_basic2_relu1", "inbound_nodes": [[["stage2_branch1_basic2_bn1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage2_branch2_basic2_res", "trainable": true, "dtype": "float32"}, "name": "stage2_branch2_basic2_res", "inbound_nodes": [[["stage2_branch2_basic2_bn2", 0, 0, {}], ["stage2_branch2_basic1_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic2_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch1_basic2_conv2", "inbound_nodes": [[["stage2_branch1_basic2_relu1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic2_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic2_out", "inbound_nodes": [[["stage2_branch2_basic2_res", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch1_basic2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch1_basic2_bn2", "inbound_nodes": [[["stage2_branch1_basic2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic3_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic3_conv1", "inbound_nodes": [[["stage2_branch2_basic2_out", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage2_branch1_basic2_res", "trainable": true, "dtype": "float32"}, "name": "stage2_branch1_basic2_res", "inbound_nodes": [[["stage2_branch1_basic2_bn2", 0, 0, {}], ["stage2_branch1_basic1_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic3_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic3_bn1", "inbound_nodes": [[["stage2_branch2_basic3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch1_basic2_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch1_basic2_out", "inbound_nodes": [[["stage2_branch1_basic2_res", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic3_relu1", "inbound_nodes": [[["stage2_branch2_basic3_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic3_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch1_basic3_conv1", "inbound_nodes": [[["stage2_branch1_basic2_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic3_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic3_conv2", "inbound_nodes": [[["stage2_branch2_basic3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch1_basic3_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch1_basic3_bn1", "inbound_nodes": [[["stage2_branch1_basic3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic3_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic3_bn2", "inbound_nodes": [[["stage2_branch2_basic3_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch1_basic3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch1_basic3_relu1", "inbound_nodes": [[["stage2_branch1_basic3_bn1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage2_branch2_basic3_res", "trainable": true, "dtype": "float32"}, "name": "stage2_branch2_basic3_res", "inbound_nodes": [[["stage2_branch2_basic3_bn2", 0, 0, {}], ["stage2_branch2_basic2_out", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic3_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch1_basic3_conv2", "inbound_nodes": [[["stage2_branch1_basic3_relu1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic3_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic3_out", "inbound_nodes": [[["stage2_branch2_basic3_res", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch1_basic3_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch1_basic3_bn2", "inbound_nodes": [[["stage2_branch1_basic3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch2_basic4_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_branch2_basic4_conv1", "inbound_nodes": [[["stage2_branch2_basic3_out", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "stage2_branch1_basic3_res", "trainable": true, "dtype": "float32"}, "name": "stage2_branch1_basic3_res", "inbound_nodes": [[["stage2_branch1_basic3_bn2", 0, 0, {}], ["stage2_branch1_basic2_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_branch2_basic4_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.1, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_branch2_basic4_bn1", "inbound_nodes": [[["stage2_branch2_basic4_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch1_basic3_out", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch1_basic3_out", "inbound_nodes": [[["stage2_branch1_basic3_res", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_branch2_basic4_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_branch2_basic4_relu1", "inbound_nodes": [[["stage2_branch2_basic4_bn1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_branch1_basic4_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", 